app/views/admin/question_types/_form.html.erb

    <%= f.label :field_type_id %><br />
    <%= f.select :field_type_id, FieldType.all.collect {|f| [ f.type_name.capitalize, f.id ] }, :prompt => 'Select Field Type' %>
---
SELECT `field_types`.* FROM `field_types`