app/controllers/admin/question_types_controller.rb

  def index
    @admin_question_types = Admin::QuestionType.all
---
SELECT `admin_question_types`.* FROM `admin_question_types`

  def show
    @admin_question_type = Admin::QuestionType.find(params[:id])
---
SELECT `admin_question_types`.* FROM `admin_question_types` WHERE `admin_question_types`.`id` = 1 LIMIT 1

  def create
    @admin_question_type = Admin::QuestionType.new(params[:admin_question_type])

    respond_to do |format|
      if @admin_question_type.save
---
INSERT INTO `admin_question_types` (`created_at`, `field_type_id`, `name`, `no_of_choices`, `updated_at`) VALUES ('2013-09-13 11:11:23', 2, 'Essay question', NULL, '2013-09-13 11:11:23')

  def check_field_optionable
    ft = FieldType.find(params[:field_id])
---
SELECT `field_types`.* FROM `field_types` WHERE `field_types`.`id` = 1 LIMIT 1